back-end/app/controllers/api_controller.rb

    mission = Mission.new
    mission.title = response["title"]
    mission.progress = 1
    mission.save
---
INSERT INTO "missions" ("title", "progress", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "ガイアセイバー症候群の治療プロセス"], ["progress", 1], ["created_at", "2023-08-21 07:41:20.592356"], ["updated_at", "2023-08-21 07:41:20.592356"]]

      sub = SubMission.new
      sub.mission = mission
      sub.content = res
      sub.save
---
INSERT INTO "sub_missions" ("mission_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["mission_id", 11], ["content", "症状の把握と診断"], ["created_at", "2023-08-21 07:41:20.706345"], ["updated_at", "2023-08-21 07:41:20.706345"]]